Autodesk.Navisworks.Api.FileReferenceResolveResult
Result of calling FileReferenceResolver::Resolve

Autodesk.Navisworks.Api.FileReferenceResolveResult.FileNameToOpen
File name that can be opened to read contents of file referred to

Autodesk.Navisworks.Api.FileReferenceResolveResult.ResolvedFileReference
Resolved (updated) reference

Autodesk.Navisworks.Api.FileReferenceResolveResult.Response
OK if reference was resolved successfully